pnkfelix/wizardry/deeper.graphviz.dot
digraph G {
    id1 [label = "A"]
    id2 [label = "D"]
    id3 [label = "E"]
    id4 [label = "F"]
    id5 [label = "G"]
    id4 -> id5 [label="sibling"]
    id6 [label = "J"]
    id4 -> id6 [label="child"]
    id3 -> id4 [label="sibling"]
    id7 [label = "H"]
    id3 -> id7 [label="child"]
    id2 -> id3 [label="child"]
    id1 -> id2 [label="sibling"]
    id8 [label = "B"]
    id9 [label = "C"]
    id10 [label = "K"]
    id9 -> id10 [label="child"]
    id8 -> id9 [label="sibling"]
    id1 -> id8 [label="child"]
}
